name: "macc3d_0.25_r2_x4"

layer {
  name: "data"
  type: "BB3TXTData"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  image_data_param {
    source: "/Users/libornovak/Data/datasets/kitti/labels/train_car.bb3txt"
    batch_size: 16
  }
  bbtxt_param {
    width: 256
    height: 128
    reference_size: 80
  }
}
layer {
  name: "data"
  type: "BB3TXTData"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  image_data_param {
    source: ""
    batch_size: 16
  }
  bbtxt_param {
    width: 256
    height: 128
    reference_size: 80
  }
}

# -------------------------------------- NETWORK STRUCTURE --------------------------------------- #
# --------------------------------------------- x  1 --------------------------------------------- #
layer {
  # -----------------------  FOV 3 x 3  (3+0=3)
  name: "conv_x1_1"
  type: "Convolution"
  bottom: "data"
  top: "conv_x1_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 3
    pad: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu_conv_x1_1"
  type: "ReLU"
  bottom: "conv_x1_1"
  top: "conv_x1_1"
}
layer {
  # -----------------------  FOV 5 x 5  (5+0=5)
  name: "conv_x1_2"
  type: "Convolution"
  bottom: "conv_x1_1"
  top: "conv_x1_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 3
    pad: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu_conv_x1_2"
  type: "ReLU"
  bottom: "conv_x1_2"
  top: "conv_x1_2"
}
# --------------------------------------------- x  2 --------------------------------------------- #
layer {
  name: "pool_x2"
  type: "Pooling"
  bottom: "conv_x1_2"
  top: "pool_x2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  # -----------------------  FOV 10 x 10  (6+4=10)
  name: "conv_x2_1"
  type: "Convolution"
  bottom: "pool_x2"
  top: "conv_x2_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 3
    pad: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu_conv_x2_1"
  type: "ReLU"
  bottom: "conv_x2_1"
  top: "conv_x2_1"
}
layer {
  # -----------------------  FOV 22 x 22  (18+4=22)
  name: "conv_x2_2"
  type: "Convolution"
  bottom: "conv_x2_1"
  top: "conv_x2_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 3
    pad: 3
    dilation: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu_conv_x2_2"
  type: "ReLU"
  bottom: "conv_x2_2"
  top: "conv_x2_2"
}
layer {
  # -----------------------  FOV 26 x 26  (22+4=26)
  name: "conv_x2_3"
  type: "Convolution"
  bottom: "conv_x2_2"
  top: "conv_x2_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 3
    pad: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu_conv_x2_3"
  type: "ReLU"
  bottom: "conv_x2_3"
  top: "conv_x2_3"
}
# --------------------------------------------- x  4 --------------------------------------------- #
layer {
  name: "pool_x4"
  type: "Pooling"
  bottom: "conv_x2_3"
  top: "pool_x4"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  # -----------------------  FOV 36 x 36  (12+24=36)
  name: "conv_x4_1"
  type: "Convolution"
  bottom: "pool_x4"
  top: "conv_x4_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    kernel_size: 3
    pad: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu_conv_x4_1"
  type: "ReLU"
  bottom: "conv_x4_1"
  top: "conv_x4_1"
}
layer {
  # -----------------------  FOV 52 x 52  (28+24=52)
  name: "conv_x4_2"
  type: "Convolution"
  bottom: "conv_x4_1"
  top: "conv_x4_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    kernel_size: 3
    pad: 2
    dilation: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu_conv_x4_2"
  type: "ReLU"
  bottom: "conv_x4_2"
  top: "conv_x4_2"
}
layer {
  # -----------------------  FOV 84 x 84  (60+24=84)
  name: "conv_x4_3"
  type: "Convolution"
  bottom: "conv_x4_2"
  top: "conv_x4_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    kernel_size: 3
    pad: 4
    dilation: 4
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu_conv_x4_3"
  type: "ReLU"
  bottom: "conv_x4_3"
  top: "conv_x4_3"
}
layer {
  # -----------------------  FOV 132 x 132  (108+24=132)
  name: "conv_x4_4"
  type: "Convolution"
  bottom: "conv_x4_3"
  top: "conv_x4_4"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    kernel_size: 3
    pad: 6
    dilation: 6
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu_conv_x4_4"
  type: "ReLU"
  bottom: "conv_x4_4"
  top: "conv_x4_4"
}
layer {
  # -----------------------  FOV 140 x 140  (116+24=140)
  name: "conv_x4_5"
  type: "Convolution"
  bottom: "conv_x4_4"
  top: "conv_x4_5"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    kernel_size: 3
    pad: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu_conv_x4_5"
  type: "ReLU"
  bottom: "conv_x4_5"
  top: "conv_x4_5"
}
layer {
  # -----------------------  ACCUMULATOR
  # -----------------------  SCALE 1/4  (FOV 140 x 140)
  # -----------------------  Ideal bounding box size: 80x80 px
  name: "acc_x4"
  type: "Convolution"
  bottom: "conv_x4_5"
  top: "acc_x4"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 8
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

# --------------------------------------------- LOSS --------------------------------------------- #
layer {
  name: "loss"
  type: "BB3TXTLoss"
  bottom: "label"
  bottom: "acc_x4"
  top: "loss"
  accumulator_loss_param {
    radius: 2
    downsampling: 4
    negative_ratio: 30
    circle_ratio: 0.250000
    bounds_overlap: -0.5
  }
}
